Reports/б_ОтчетПоБюджетуБОАнализПоДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>б_ОтчетПоБюджетуБОАнализПоДокументам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаОрганизаций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаПодразделений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтрицательноеКрасным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтчета</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируемыйБюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/б_БюджетФакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>б_БюджетФакт</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.битИсточникиФинансирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ПорядкиОкругленияОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПорядкиОкругленияОтчетности</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Окр1</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1000</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1000000</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/б_ОтчетПоБюджетуБОАнализПоДокументам/Ext/ObjectModule.bsl
Перем мСписокИсточниковФинансирования Экспорт;
Перем мСписокСтруктурныхЕдиниц Экспорт;
Перем мСписокПодразделений Экспорт;
Перем мДеревоСтруктурныхЕдиниц Экспорт;
Перем СохраненнаяНастройка Экспорт;
Перем Расшифровки Экспорт;
Перем ПромежуточныеДанные Экспорт;
Перем РежимРасшифровки Экспорт;
Перем ВедётсяУчетПоПодразделениям Экспорт;

#Если Клиент Тогда

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	СтандартныеОтчеты.ЗаполнитьДанныеОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина, ВнешниеНаборыДанных = Неопределено) Экспорт
	
	Результат.Очистить();
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ВыводЗаголовкаОтчета(ЭтотОбъект, Результат);
	ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных);
	СтандартныеОтчеты.ВывестиОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных);
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	// Выполним дополнительную обработку Результата отчета
	ОбработкаРезультатаОтчета(Результат);
	
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(Результат, ПолучитьТекстЗаголовка(), Строка(глТекущийПользователь));
	
	Возврат;
	
КонецПроцедуры

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных) Экспорт
	
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(НачалоПериода));
	Иначе
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", Дата(1, 1, 1));
	КонецЕсли;
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(КонецПериода));
	Иначе
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", Дата(3999, 11, 1));
	КонецЕсли;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВыборкаДанных = ПолучитьВыборку();
	ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ВыборкаДанных);
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаИтого");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "Итого "+Год(НачалоПериода)+" год";
	КонецЕсли;
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаПредыдущий");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "Факт "+Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1)))+" года";
	КонецЕсли;
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаПредществующий");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "Факт "+Год( НачалоДня(Дата(Год(НачалоПериода)-2,1,1)))+" года";
	КонецЕсли;
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаТриГодаНазад");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "Факт "+Год( НачалоДня(Дата(Год(НачалоПериода)-3,1,1)))+" года";
	КонецЕсли;
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаТриГодаНазад");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "Факт "+Год( НачалоДня(Дата(Год(НачалоПериода)-3,1,1)))+" года";
	КонецЕсли;
	
	//Предыдущий период
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПредыдущегоПериода", НачалоДня(Дата(Год(НачалоПериода)-1,1,1)));
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПредыдущегоПериода", КонецДня(Дата(Год(НачалоПериода)-1,12,31)));

	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПредществующегоПериода", НачалоДня(Дата(Год(НачалоПериода)-2,1,1)));
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПредществующегоПериода", КонецДня(Дата(Год(НачалоПериода)-2,12,31)));

	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоТриГодаНазад", НачалоДня(Дата(Год(НачалоПериода)-3,1,1)));
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецТриГодаНазад", КонецДня(Дата(Год(НачалоПериода)-3,12,31)));
	
	Если мДеревоСтруктурныхЕдиниц.Колонки.Количество() = 0 Тогда 
		
		СписокСтруктурныхЕдиниц = Новый СписокЗначений;
		СписокСтруктурныхЕдиниц.ЗагрузитьЗначения(мСписокСтруктурныхЕдиниц.ВыгрузитьЗначения());
		
		Для Каждого СтрПодразделение Из мСписокПодразделений Цикл 
			СписокСтруктурныхЕдиниц.Добавить(СтрПодразделение.Значение);
		КонецЦикла;		
				
		мДеревоСтруктурныхЕдиниц = СтандартныеОтчеты.СформироватьДеревоСЕ(, СписокСтруктурныхЕдиниц);
		
	КонецЕсли;
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ФормируемыйБюджет", ФормируемыйБюджет);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ЕдиницаИзмерения", ЕдиницаИзмерения);
	
	ТиповыеОтчеты.ДобавитьОтборПоОрганизациямИПодразделениям(КомпоновщикНастроек, мДеревоСтруктурныхЕдиниц);
	
КонецПроцедуры

Процедура ИнициализацияОтчета() Экспорт
	
	СтандартныеОтчеты.ИнициализацияОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура ВыводПодписиОтчета(Результат)
	
	//Макет = ПолучитьОбщийМакет("ОбщиеОбластиСтандартногоОтчета");
	//ОбластьПодписи        = Макет.ПолучитьОбласть("ПодписиПроверил");
	//Результат.Вывести(ОбластьПодписи);
	
КонецПроцедуры

Процедура ВыводЗаголовкаОтчета(ОтчетОбъект, Результат)
	
	СтандартныеОтчеты.ВыводЗаголовкаСпециализированногоОтчета(ОтчетОбъект, Результат);
			
КонецПроцедуры

Функция ПолучитьТекстЗаголовка(ОрганизацияВНачале = Истина) Экспорт 
		
	ЗаголовокОтчета = СокрЛП(ФормируемыйБюджет.Наименование) + СтандартныеОтчеты.ПолучитьПредставлениеПериода(ЭтотОбъект);

	Возврат ?(ОрганизацияВНачале, ЗаголовокОтчета, ЗаголовокОтчета + " " + СтандартныеОтчеты.ПолучитьТекстОрганизация(ЭтотОбъект));
		
КонецФункции

Функция ПолучитьВыборку ()
	
	Запрос = Новый Запрос;
         
	Запрос.Текст =
	"ВЫБРАТЬ
	|	б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Ссылка.Организация КАК Организация,
	|	б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Ссылка.СтатьяБюджета КАК СтатьяБюджета,
	|	б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Ссылка.Состояние КАК Статус,
	|	б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Ссылка КАК ДокументДвижения,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) = 1
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЯнварь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) = 2
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаФевраль,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) = 3
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаМарт,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) = 4
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаАпрель,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) = 5
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаМай,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) = 6
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаИюнь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) = 7
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаИюль,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) = 8
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаАвгуст,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) = 9
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаСентябрь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) = 10
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаОктябрь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) = 11
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНоябрь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) = 12
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДекабрь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) < 4
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПервыйКвартал,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) > 3
	|				И МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) < 7
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВторойКвартал,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) > 6
	|				И МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) < 10
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаТретийКвартал,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) > 9
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЧетвертыйКвартал,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) < 7
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЗаПолугодие,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) < 10
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЗаДевятьМесяцев,
	|	ВЫБОР
	|		КОГДА б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Ссылка.ФормируемыйБюджет.ЦС_РасчетНеНакоплением
	|			ТОГДА ВЫБОР
	|					КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Период) = 12
	|						ТОГДА ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|									ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|								ИНАЧЕ ВЫБОР
	|										КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|											ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|										ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000000
	|				ИНАЧЕ ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|							ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0) / 1000
	|						ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.СуммаСНДС, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаИтого,
	|	0 КАК СуммаИтогоФакт,
	|	0 КАК СуммаПредыдущий,
	|	0 КАК СуммаПредществующий,
	|	0 КАК СуммаТриГодаНазад,
	|	0 КАК ПризнакКоличество
	|ИЗ
	|	Документ.б_РасчетнаяТаблицаРеализации.РасчетнаяТаблица КАК б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица
	|ГДЕ
	|	НЕ б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Ссылка.ПометкаУдаления
	|	И б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Ссылка.ПериодПланирования МЕЖДУ &Началопериода И &КонецПериода
	|	И б_РасчетнаяТаблицаРеализацииРасчетнаяТаблица.Ссылка.ФормируемыйБюджет = &ФормируемыйБюджет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Ссылка.Организация,
	|	б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.СтатьяБюджета,
	|	б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Ссылка.Состояние,
	|	б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Ссылка,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) = 1
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) = 2
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) = 3
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) = 4
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) = 5
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) = 6
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) = 7
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) = 8
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) = 9
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) = 10
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) = 11
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) = 12
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) < 4
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) > 3
	|				И МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) < 7
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) > 6
	|				И МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) < 10
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) > 9
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) < 7
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) < 10
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Ссылка.ФормируемыйБюджет.ЦС_РасчетНеНакоплением
	|			ТОГДА ВЫБОР
	|					КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Период) = 12
	|						ТОГДА ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|									ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|								ИНАЧЕ ВЫБОР
	|										КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|											ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|										ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000000
	|				ИНАЧЕ ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|							ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0) / 1000
	|						ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Сумма, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	Документ.б_РасчетнаяТаблицаРасходовПоПеремещениюРеализации.РасчетнаяТаблица КАК б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица
	|ГДЕ
	|	НЕ б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Ссылка.ПометкаУдаления
	|	И б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Ссылка.ПериодПланирования МЕЖДУ &Началопериода И &КонецПериода
	|	И б_РасчетнаяТаблицаРасходовПоПеремещениюРеализацииРасчетнаяТаблица.Ссылка.ФормируемыйБюджет = &ФормируемыйБюджет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	б_РасчетнаяТаблицаРасчетнаяТаблица.Ссылка.Организация,
	|	б_РасчетнаяТаблицаРасчетнаяТаблица.Ссылка.СтатьяБюджета,
	|	б_РасчетнаяТаблицаРасчетнаяТаблица.Ссылка.Состояние,
	|	б_РасчетнаяТаблицаРасчетнаяТаблица.Ссылка,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма1, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма1, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма1, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма2, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма2, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма2, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма3, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма3, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма3, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма4, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма4, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма4, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма5, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма5, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма5, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма6, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма6, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма6, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма7, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма7, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма7, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма8, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма8, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма8, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма9, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма9, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма9, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма10, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма10, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма10, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма11, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма11, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма11, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма12, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма12, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма12, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА (ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма1, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма2, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма3, 0)) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА (ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма1, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма2, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма3, 0)) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма1, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма2, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма3, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА (ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма4, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма5, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма6, 0)) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА (ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма4, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма5, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма6, 0)) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма4, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма5, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма6, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА (ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма7, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма8, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма9, 0)) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА (ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма7, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма8, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма9, 0)) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма7, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма8, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма9, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА (ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма10, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма11, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма12, 0)) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА (ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма10, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма11, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма12, 0)) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма10, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма11, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма12, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА (ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма1, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма2, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма3, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма4, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма5, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма6, 0)) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА (ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма1, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма2, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма3, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма4, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма5, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма6, 0)) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма1, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма2, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма3, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма4, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма5, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма6, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА (ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма1, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма2, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма3, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма4, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма5, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма6, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма7, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма8, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма9, 0)) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА (ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма1, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма2, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма3, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма4, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма5, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма6, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма7, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма8, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма9, 0)) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма1, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма2, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма3, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма4, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма5, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма6, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма7, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма8, 0) + ЕСТЬNULL(б_РасчетнаяТаблицаРасчетнаяТаблица.Сумма9, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	б_РасчетнаяТаблицаРасчетнаяТаблица.КонтрольнаяСумма,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК б_РасчетнаяТаблицаРасчетнаяТаблица
	|ГДЕ
	|	НЕ б_РасчетнаяТаблицаРасчетнаяТаблица.Ссылка.ПометкаУдаления
	|	И б_РасчетнаяТаблицаРасчетнаяТаблица.Ссылка.ПериодПланирования МЕЖДУ &Началопериода И &КонецПериода
	|	И б_РасчетнаяТаблицаРасчетнаяТаблица.Ссылка.ФормируемыйБюджет = &ФормируемыйБюджет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БюджетОборотыФакт.Организация,
	|	БюджетОборотыФакт.СтатьяБюджета,
	|	БюджетОборотыФакт.Статус,
	|	БюджетОборотыФакт.Регистратор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА БюджетОборотыФакт.Бюджет.ЦС_РасчетНеНакоплением
	|			ТОГДА ВЫБОР
	|					КОГДА МЕСЯЦ(БюджетОборотыФакт.Период) = 12
	|						ТОГДА ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|									ТОГДА ЕСТЬNULL(БюджетОборотыФакт.СуммаОборот, 0) / 1000000
	|								ИНАЧЕ ВЫБОР
	|										КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|											ТОГДА ЕСТЬNULL(БюджетОборотыФакт.СуммаОборот, 0) / 1000
	|										ИНАЧЕ ЕСТЬNULL(БюджетОборотыФакт.СуммаОборот, 0)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|					ТОГДА ЕСТЬNULL(БюджетОборотыФакт.СуммаОборот, 0) / 1000000
	|				ИНАЧЕ ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|							ТОГДА ЕСТЬNULL(БюджетОборотыФакт.СуммаОборот, 0) / 1000
	|						ИНАЧЕ ЕСТЬNULL(БюджетОборотыФакт.СуммаОборот, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	БюджетОборотыФакт.ПризнакКоличествоОборот
	|ИЗ
	|	РегистрНакопления.б_БюджетФакт.Обороты(&Началопериода, &КонецПериода, Регистратор, Бюджет = &ФормируемыйБюджет) КАК БюджетОборотыФакт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БюджетФактОбороты.Организация,
	|	БюджетФактОбороты.СтатьяБюджета,
	|	БюджетФактОбороты.Статус,
	|	БюджетФактОбороты.Регистратор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА БюджетФактОбороты.Бюджет.ЦС_РасчетНеНакоплением
	|			ТОГДА ВЫБОР
	|					КОГДА МЕСЯЦ(БюджетФактОбороты.Период) = 12
	|						ТОГДА ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|									ТОГДА ЕСТЬNULL(БюджетФактОбороты.СуммаОборот, 0) / 1000000
	|								ИНАЧЕ ВЫБОР
	|										КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|											ТОГДА ЕСТЬNULL(БюджетФактОбороты.СуммаОборот, 0) / 1000
	|										ИНАЧЕ ЕСТЬNULL(БюджетФактОбороты.СуммаОборот, 0)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|					ТОГДА ЕСТЬNULL(БюджетФактОбороты.СуммаОборот, 0) / 1000000
	|				ИНАЧЕ ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|							ТОГДА ЕСТЬNULL(БюджетФактОбороты.СуммаОборот, 0) / 1000
	|						ИНАЧЕ ЕСТЬNULL(БюджетФактОбороты.СуммаОборот, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	БюджетФактОбороты.ПризнакКоличествоОборот
	|ИЗ
	|	РегистрНакопления.б_БюджетФакт.Обороты(&НачалоПредыдущегопериода, &КонецПредыдущегоПериода, Регистратор, Бюджет = &ФормируемыйБюджет) КАК БюджетФактОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БюджетФактОбороты_Доп.Организация,
	|	БюджетФактОбороты_Доп.СтатьяБюджета,
	|	БюджетФактОбороты_Доп.Статус,
	|	БюджетФактОбороты_Доп.Регистратор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА БюджетФактОбороты_Доп.Бюджет.ЦС_РасчетНеНакоплением
	|			ТОГДА ВЫБОР
	|					КОГДА МЕСЯЦ(БюджетФактОбороты_Доп.Период) = 12
	|						ТОГДА ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|									ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0) / 1000000
	|								ИНАЧЕ ВЫБОР
	|										КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|											ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0) / 1000
	|										ИНАЧЕ ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|					ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0) / 1000000
	|				ИНАЧЕ ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|							ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0) / 1000
	|						ИНАЧЕ ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	БюджетФактОбороты_Доп.ПризнакКоличествоОборот
	|ИЗ
	|	РегистрНакопления.б_БюджетФакт.Обороты(&НачалоПредществующегоПериода, &КонецПредществующегоПериода, Регистратор, Бюджет = &ФормируемыйБюджет) КАК БюджетФактОбороты_Доп
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БюджетФактОбороты_Доп.Организация,
	|	БюджетФактОбороты_Доп.СтатьяБюджета,
	|	БюджетФактОбороты_Доп.Статус,
	|	БюджетФактОбороты_Доп.Регистратор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА БюджетФактОбороты_Доп.Бюджет.ЦС_РасчетНеНакоплением
	|			ТОГДА ВЫБОР
	|					КОГДА МЕСЯЦ(БюджетФактОбороты_Доп.Период) = 12
	|						ТОГДА ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|									ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0) / 1000000
	|								ИНАЧЕ ВЫБОР
	|										КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|											ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0) / 1000
	|										ИНАЧЕ ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|					ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0) / 1000000
	|				ИНАЧЕ ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|							ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0) / 1000
	|						ИНАЧЕ ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	БюджетФактОбороты_Доп.ПризнакКоличествоОборот
	|ИЗ
	|	РегистрНакопления.б_БюджетФакт.Обороты(&НачалоТриГодаНазад, &КонецТриГодаНазад, Регистратор, Бюджет = &ФормируемыйБюджет) КАК БюджетФактОбороты_Доп";

	Запрос.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("ФормируемыйБюджет",ФормируемыйБюджет);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("НачалоПредыдущегопериода", НачалоДня(Дата(Год(НачалоПериода)-1,1,1)));
	Запрос.УстановитьПараметр("КонецПредыдущегоПериода",КонецДня(Дата(Год(НачалоПериода)-1,12,31)));
	Запрос.УстановитьПараметр("НачалоПредществующегоПериода",НачалоДня(Дата(Год(НачалоПериода)-2,1,1)));
	Запрос.УстановитьПараметр("КонецПредществующегоПериода", КонецДня(Дата(Год(НачалоПериода)-2,12,31)));
	Запрос.УстановитьПараметр("НачалоТриГодаНазад",НачалоДня(Дата(Год(НачалоПериода)-3,1,1)));
	Запрос.УстановитьПараметр("КонецТриГодаНазад", КонецДня(Дата(Год(НачалоПериода)-3,12,31)));
	
	Возврат Запрос.Выполнить();


КонецФункции

Процедура ОбработкаРезультатаОтчета(Результат)
	
	ТиповыеОтчеты.ОбработкаРезультатаОтчета(ЭтотОбъект, Результат);

КонецПроцедуры

// Для настройки отчета (расшифровка и др.)
Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
	
	//ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
	ЗаполнитьНачальныеНастройки();
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	
	СтруктураНастроек.Вставить("мСписокПодразделений", мСписокПодразделений);
	СтруктураНастроек.Вставить("мСписокСтруктурныхЕдиниц", мСписокСтруктурныхЕдиниц);
	СтруктураНастроек.Вставить("мДеревоСтруктурныхЕдиниц", мДеревоСтруктурныхЕдиниц);
	
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);

КонецПроцедуры

// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	 
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры


Расшифровки = Новый СписокЗначений;

НастройкаПериода = Новый НастройкаПериода;

#КонецЕсли
мСписокИсточниковФинансирования = Новый СписокЗначений;
мСписокСтруктурныхЕдиниц = Новый СписокЗначений;
мСписокПодразделений = Новый СписокЗначений;
мДеревоСтруктурныхЕдиниц = Новый ДеревоЗначений;

ВедётсяУчетПоПодразделениям = ОбщегоНазначения.ПолучитьПризнакОтображенияСтруктурныхПодразделений();

РежимРасшифровки = Ложь;
